---
kind: method
id: M:Autodesk.Revit.DB.View.GetReferenceCallouts
zh: 视图
source: html/00cf51d8-dfcd-3bb3-91e8-91b49d0c4f0d.htm
---
# Autodesk.Revit.DB.View.GetReferenceCallouts Method

**中文**: 视图

Returns element ids of all reference callouts in the view.

## Syntax (C#)
```csharp
public ICollection<ElementId> GetReferenceCallouts()
```

## Returns
Element ids of all reference callouts in the view.